app/controllers/home_controller.rb

  def index
    @lists = List.all
    @first_list = @lists.first

    @tasks = Task.where("list_id = ?",@first_list.id)
---
SELECT  `lists`.* FROM `lists`  ORDER BY `lists`.`id` ASC LIMIT 1
SELECT `tasks`.* FROM `tasks` WHERE (list_id = 1) AND (is_deleted = 1)