app/controllers/task_controller.rb

  def index
    id = params[:list_id]
    @is_deleted = params[:is_deleted]

    @list = List.find(id)

    @rs_tasks = Task.where("list_id = ?",id)
---
SELECT  `lists`.* FROM `lists` WHERE `lists`.`id` = 2 LIMIT 1
SELECT `tasks`.* FROM `tasks` WHERE (list_id = '2') AND (is_deleted = 1)